<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"1391ed1e73bbd07f116e3255be228f602541d5bc9536d6be60957d7accb3fc79","plan_job_ref":"Job Staging Image Build & Push #52 at https://github.com/IrezD/python-fastAPI-docker-image/actions/runs/7337590022","plan_hash":"8bf65ff4357e48b2f4042258ca49223d80e66370b7c137e5ac2daa31fa60ef81","plan_text_format":"diff","version":"1.39.0"} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 2 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.fastapi-service will be updated in-place
!~  resource "aws_ecs_service" "fastapi-service" {
        id                                 = "arn:aws:ecs:eu-central-1:806066816337:service/fastapi-cluster/dev-fastapi-service"
        name                               = "dev-fastapi-service"
        tags                               = {}
!~      tags_all                           = {
+           "Environment" = "Dev Environment"
        }
#        (16 unchanged attributes hidden)

+       load_balancer {
+           container_name   = "mongo"
+           container_port   = 8080
+           target_group_arn = (known after apply)
        }

#        (3 unchanged blocks hidden)
    }

  # aws_lb_listener.front_end will be created
+   resource "aws_lb_listener" "front_end" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       load_balancer_arn = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:loadbalancer/app/fastapi-lb-dev/a62c3bfa18223c2b"
+       port              = 5000
+       protocol          = "HTTP"
+       ssl_policy        = (known after apply)
+       tags_all          = {
+           "Environment" = "Dev Environment"
        }

+       default_action {
+           order            = (known after apply)
+           target_group_arn = (known after apply)
+           type             = "forward"
        }
    }

  # aws_lb_target_group.alb-tg must be replaced
+/- resource "aws_lb_target_group" "alb-tg" {
!~      arn                                = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:targetgroup/fastapi-alb-target-group-for-dev/624a71af6d7cb76d" -> (known after apply)
!~      arn_suffix                         = "targetgroup/fastapi-alb-target-group-for-dev/624a71af6d7cb76d" -> (known after apply)
!~      connection_termination             = false -> (known after apply)
!~      id                                 = "********************************************************************************************************************" -> (known after apply)
!~      ip_address_type                    = "ipv4" -> (known after apply)
+       load_balancing_algorithm_type      = (known after apply)
!~      load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> (known after apply)
        name                               = "fastapi-alb-target-group-for-dev"
+       name_prefix                        = (known after apply)
!~      preserve_client_ip                 = "true" -> (known after apply)
!~      protocol                           = "TCP" -> "HTTP" # forces replacement
+       protocol_version                   = (known after apply)
-       tags                               = {} -> null
#        (8 unchanged attributes hidden)

-       health_check {
-           enabled             = true -> null
-           healthy_threshold   = 5 -> null
-           interval            = 30 -> null
-           matcher             = "200-399" -> null
-           path                = "/" -> null
-           port                = "traffic-port" -> null
-           protocol            = "HTTP" -> null
-           timeout             = 6 -> null
-           unhealthy_threshold = 2 -> null
        }

-       stickiness {
-           cookie_duration = 0 -> null
-           enabled         = false -> null
-           type            = "source_ip" -> null
        }

-       target_failover {}

-       target_health_state {}
    }

Plan: 2 to add, 1 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Staging Image Build & Push #52](https://github.com/IrezD/python-fastAPI-docker-image/actions/runs/7337590022)